# 3-1 나만의 데이터 만들기

In [3]:
import pandas as pd
s=pd.Series(['banana',42])
s

0    banana
1        42
dtype: object

In [4]:
s=pd.Series(['Wes McKinny', 'Creator of Pandas'])
s

0          Wes McKinny
1    Creator of Pandas
dtype: object

In [5]:
s=pd.Series(['Wes Mckinney','Creator od Pandas'], index=['Person','Who'])
s

Person         Wes Mckinney
Who       Creator od Pandas
dtype: object

In [6]:
#데이터 프레임을 만들기 위해서는 딕셔녀리를 클래스에 전달해야함. 
scientists=pd.DataFrame({
    'name':['Rosaline Franklin', 'William Gosset'],
    'Occupation':['Chemist', 'Statistician'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]
})
scientists

                name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 3-2 시리즈 다루기 기초

In [7]:
import pandas as pd

In [8]:
scientists = pd.DataFrame(
    data={'Occuapation':['Chemist','Statistician'],
         'Born':['1920-07-25','1876-06-13'],
         'Died':['1958-04-16','1937-10-16'],
         'Age':[37,61]},
    index=['Rosaline Fanklin','William Gosset'],
    columns=['Occuapation','Born','Died','Age']
)

In [9]:
first_row=scientists.loc['William Gosset']
type(first_row)

pandas.core.series.Series

In [10]:
first_row

Occuapation    Statistician
Born             1876-06-13
Died             1937-10-16
Age                      61
Name: William Gosset, dtype: object

In [11]:
#index 속성 활용하기
first_row.index

Index(['Occuapation', 'Born', 'Died', 'Age'], dtype='object')

In [12]:
#values 속성 활용하기
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

In [13]:
#key 메소드 사용하기
first_row.keys()

Index(['Occuapation', 'Born', 'Died', 'Age'], dtype='object')

In [14]:
#index 속성 응용하기
first_row.index[0]

'Occuapation'

In [15]:
#key 메소드 응용하기
first_row.keys()[0]

'Occuapation'

In [16]:
#시리드의 기초 통계 매서드 사용하기
ages=scientists['Age']
ages

Rosaline Fanklin    37
William Gosset      61
Name: Age, dtype: int64

In [17]:
#평균
ages.mean()

49.0

In [18]:
#최소 최대
print(ages.min())
print(ages.max())

37
61

In [19]:
#표준편차
ages.std()

16.97056274847714

# 3-3 시리즈 다루기 -응용

In [23]:
scientists=pd.read_csv('doit_pandas-master/data/scientists.csv')

In [24]:
ages=scientists['Age']

In [25]:
print(ages.mean())
print(ages.max())

59.125
90

In [26]:
ages[ages>ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [27]:
ages>ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [28]:
manual_bool_values=[True, True, False, False, True, True, False, True]
ages[manual_bool_values]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

# 시리즈와 브로드캐스팅

In [29]:
 # 모든 데이터에 대해 한 번에 연산하는 것 => 브로드캐스팅
 # 시리즈처럼 여러개의 데이터를 갖는 것을 => 벡터
 # 단순 크기를 나타내는 데이터를 => 스칼라

In [30]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [31]:
ages*ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [32]:
ages+100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [33]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [34]:
# 서로 다른 길이의 벡터를 연산할 경우 => 시리즈와 시리즈를 연산하는 경우 같은 인덱스 값만 계산하고 나머지는 nan으로 처리
pd.Series([1,100])

0      1
1    100
dtype: int64

In [35]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [36]:
#인덱스 역순으로 정렬하기. 
rev_ages = ages.sort_index(ascending=False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [37]:
# 벡터와 벡터의 연산은 일치하는 인덱스 값끼리 수행하므로 출력값이 동일
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [38]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

# 3-4 데이터 프레임 다루기

In [40]:
#불린 추출과 브로드캐스팅
scientists[scientists["Age"] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [41]:
#브로드캐스팅 하기 => 문자열 데이터가 다 2배가 됨. 
scientists *2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [46]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

# 3-5 시리즈와 데이터프레임의 데이터 처리하기

In [43]:
#날짜를 문자열로 저장한 데이터는 시간 관련 작업을 할 수 있도록 datatime 자료형으로 바꾸는 것이 좋음
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [44]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [47]:
#새로운 열 추가하기
scientists['born_dt'],scientists['died_dt']=(born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [48]:
scientists.shape

(8, 7)

In [49]:
#얼마동안 세상에 살다갔는지 계산하기
scientists['age_dts_dt']=(scientists['died_dt']-scientists['born_dt'])
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_dts_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [50]:
# 시리드와 데이터 프레임의 데이터 섞어보기
scientists['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [51]:
import random

In [52]:
random.seed(42) # seed메서드는 컴퓨터가 생성하느 난수의 기준값을 정하기 위해 사용
random.shuffle(scientists['Age'])
scientists['Age']

C:\Users\kiminae\Anaconda3\envs\study\lib\random.py:278: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  x[i], x[j] = x[j], x[i]

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

In [53]:
#데이터프레임의 열 삭제하기
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_dts_dt'],
      dtype='object')

In [54]:
scientists_dropped = scientists.drop(['Age'], axis=1)
scientists_dropped

,Name,Born,Died,Occupation,born_dt,died_dt,age_dts_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [55]:
# 데이터를 저장하고 불러오기

#피클로 저장하기 => 피클은 데이터를 바이너리 형태로 직렬화한 오브젝트를 저장하는 방법,
#피클로 저장시 스프레드시트보다 더 작은 용량으로 데이터를 저장할 수 있어 매우 편리
#시리즈를 피클로 저장하려면 to_pickle 메서드를 사용하면 되는데 이떄 저장 경로를 문자열로 전달해야함. 
names=scientists['Name']
names.to_pickle('./doit_pandas-master/scientists_names_series.pickle')

In [56]:
scientists_names_from_pickle=pd.read_pickle('../doit_pandas-master/doit_pandas-master/scientists_names_series.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [57]:
#데이터프레임도 피클로 저장이 가능
scientists.to_pickle('./doit_pandas-master/scientists_df.pickle')

In [58]:
scientists_from_pickle=pd.read_pickle('../doit_pandas-master/doit_pandas-master/scientists_df.pickle')
scientists_from_pickle

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_dts_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23,28422 days